#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_policy.ecs_task_execution_policy: Refreshing state... [id=arn:aws:iam::038112379193:policy/ecsTaskExecutionPolicy]
aws_vpc.my_vpc: Refreshing state... [id=vpc-0ddad86394ef2ac95]
aws_ecs_cluster.MyCluster: Refreshing state... [id=arn:aws:ecs:us-east-1:038112379193:cluster/MyCluster]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecsTaskExecutionRole]
aws_internet_gateway.my_gateway: Refreshing state... [id=igw-042b8a90f07be2465]
aws_subnet.subnet_a: Refreshing state... [id=subnet-0ce6dc8e2a864284b]
aws_lb_target_group.client-lb-target-group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:038112379193:targetgroup/client-tg/18af46ec95b230ce]
aws_subnet.subnet_b: Refreshing state... [id=subnet-0ce3a4360747f9857]
aws_lb_target_group.server-lb-target-group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:038112379193:targetgroup/server-tg/0dc5c90076036277]
aws_security_group.ContainerFromALBSecurityGroup: Refreshing state... [id=sg-019b38a59e83707d4]
aws_iam_role_policy_attachment.ecs_task_execution_policy_attachment: Refreshing state... [id=ecsTaskExecutionRole-20230202185543666800000001]
aws_route_table.my_route_table: Refreshing state... [id=rtb-036555d8063809bc4]
aws_lb.client-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:038112379193:loadbalancer/app/client-alb/4dcd2a507c92e302]
aws_lb.server-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:038112379193:loadbalancer/app/server-lb/73f38d504c36f084]
aws_ecs_task_definition.client-task-definition: Refreshing state... [id=client-task-definition]
aws_ecs_task_definition.server-task-definition: Refreshing state... [id=server-task-definition]
aws_route_table_association.subnet_b: Refreshing state... [id=rtbassoc-08c72aa0ecbfca5dd]
aws_route_table_association.subnet_a: Refreshing state... [id=rtbassoc-036236bf75d5d6848]
aws_lb_listener.client-lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:038112379193:listener/app/client-alb/4dcd2a507c92e302/9d4603744d9a7f5e]
aws_lb_listener.lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:038112379193:listener/app/server-lb/73f38d504c36f084/13909fe7ee865f32]
aws_ecs_service.client-container-service: Refreshing state... [id=arn:aws:ecs:us-east-1:038112379193:service/MyCluster/client-container-service]
aws_ecs_service.server-container-service: Refreshing state... [id=arn:aws:ecs:us-east-1:038112379193:service/MyCluster/server-container-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_ecs_cluster.MyCluster has been deleted
  - resource "aws_ecs_cluster" "MyCluster" {
      - id                 = "arn:aws:ecs:us-east-1:038112379193:cluster/MyCluster" -> null
        name               = "MyCluster"
        tags               = {}
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_internet_gateway.my_gateway has been deleted
  - resource "aws_internet_gateway" "my_gateway" {
      - id       = "igw-042b8a90f07be2465" -> null
        tags     = {
            "Name" = "My Gateway"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_lb.client-lb has been deleted
  - resource "aws_lb" "client-lb" {
      - arn                              = "arn:aws:elasticloadbalancing:us-east-1:038112379193:loadbalancer/app/client-alb/4dcd2a507c92e302" -> null
      - dns_name                         = "client-alb-591038820.us-east-1.elb.amazonaws.com" -> null
        id                               = "arn:aws:elasticloadbalancing:us-east-1:038112379193:loadbalancer/app/client-alb/4dcd2a507c92e302"
        name                             = "client-alb"
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb.server-lb has been deleted
  - resource "aws_lb" "server-lb" {
      - arn                              = "arn:aws:elasticloadbalancing:us-east-1:038112379193:loadbalancer/app/server-lb/73f38d504c36f084" -> null
      - dns_name                         = "server-lb-207499078.us-east-1.elb.amazonaws.com" -> null
        id                               = "arn:aws:elasticloadbalancing:us-east-1:038112379193:loadbalancer/app/server-lb/73f38d504c36f084"
        name                             = "server-lb"
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_route_table.my_route_table has been deleted
  - resource "aws_route_table" "my_route_table" {
      - id               = "rtb-036555d8063809bc4" -> null
        tags             = {
            "Name" = "My Route Table"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.ContainerFromALBSecurityGroup has been deleted
  - resource "aws_security_group" "ContainerFromALBSecurityGroup" {
      - id                     = "sg-019b38a59e83707d4" -> null
        name                   = "security_group"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.subnet_a has been deleted
  - resource "aws_subnet" "subnet_a" {
      - id                                             = "subnet-0ce6dc8e2a864284b" -> null
        tags                                           = {
            "Name" = "Subnet A"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_subnet.subnet_b has been deleted
  - resource "aws_subnet" "subnet_b" {
      - id                                             = "subnet-0ce3a4360747f9857" -> null
        tags                                           = {
            "Name" = "Subnet B"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_vpc.my_vpc has been deleted
  - resource "aws_vpc" "my_vpc" {
      - id                                   = "vpc-0ddad86394ef2ac95" -> null
        tags                                 = {
            "Name" = "VPC"
        }
        # (17 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.MyCluster will be created
  + resource "aws_ecs_cluster" "MyCluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "MyCluster"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.client-container-service will be created
  + resource "aws_ecs_service" "client-container-service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "client-container-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "client"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.server-container-service will be created
  + resource "aws_ecs_service" "server-container-service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "server-container-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "server"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.client-task-definition must be replaced
-/+ resource "aws_ecs_task_definition" "client-task-definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:038112379193:task-definition/client-task-definition:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "REACT_APP_BASEURL"
                          - value = "http://server-lb-207499078.us-east-1.elb.amazonaws.com/api/"
                        },
                    ]
                  - essential        = true
                  - image            = "ghcr.io/ofelix60/inventory-app_client:main"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "firelens-container"
                          - awslogs-region        = "us-west-2"
                          - awslogs-stream-prefix = "firelens"
                        }
                    }
                  - memory           = 2048
                  - mountPoints      = []
                  - name             = "client"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "client-task-definition" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.server-task-definition must be replaced
-/+ resource "aws_ecs_task_definition" "server-task-definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:038112379193:task-definition/server-task-definition:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "CLIENT_URL"
                          - value = "http://client-alb-591038820.us-east-1.elb.amazonaws.com"
                        },
                      - {
                          - name  = "DATABASE_URL"
                          - value = "postgres://ofelix60:Y4oan0zFXPqC@ep-late-limit-066898.us-west-2.aws.neon.tech/neondb"
                        },
                      - {
                          - name  = "SECRET"
                          - value = "qwerty"
                        },
                    ]
                  - essential        = true
                  - image            = "ghcr.io/ofelix60/inventory-app_server:main"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "firelens-container"
                          - awslogs-region        = "us-west-2"
                          - awslogs-stream-prefix = "firelens"
                        }
                    }
                  - memory           = 2048
                  - mountPoints      = []
                  - name             = "server"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "server-task-definition" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_internet_gateway.my_gateway will be created
  + resource "aws_internet_gateway" "my_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "My Gateway"
        }
      + tags_all = {
          + "Name" = "My Gateway"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lb.client-lb will be created
  + resource "aws_lb" "client-lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "client-alb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb.server-lb will be created
  + resource "aws_lb" "server-lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "server-lb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.client-lb-listener will be created
  + resource "aws_lb_listener" "client-lb-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.lb-listener will be created
  + resource "aws_lb_listener" "lb-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.client-lb-target-group must be replaced
-/+ resource "aws_lb_target_group" "client-lb-target-group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:038112379193:targetgroup/client-tg/18af46ec95b230ce" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/client-tg/18af46ec95b230ce" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:038112379193:targetgroup/client-tg/18af46ec95b230ce" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "client-tg"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ vpc_id                             = "vpc-0ddad86394ef2ac95" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_lb_target_group.server-lb-target-group must be replaced
-/+ resource "aws_lb_target_group" "server-lb-target-group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:038112379193:targetgroup/server-tg/0dc5c90076036277" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/server-tg/0dc5c90076036277" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:038112379193:targetgroup/server-tg/0dc5c90076036277" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "server-tg"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ vpc_id                             = "vpc-0ddad86394ef2ac95" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_route_table.my_route_table will be created
  + resource "aws_route_table" "my_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "My Route Table"
        }
      + tags_all         = {
          + "Name" = "My Route Table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.subnet_a will be created
  + resource "aws_route_table_association" "subnet_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.subnet_b will be created
  + resource "aws_route_table_association" "subnet_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.ContainerFromALBSecurityGroup will be created
  + resource "aws_security_group" "ContainerFromALBSecurityGroup" {
      + arn                    = (known after apply)
      + description            = "Allow traffic to the client container"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "security_group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.subnet_a will be created
  + resource "aws_subnet" "subnet_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Subnet A"
        }
      + tags_all                                       = {
          + "Name" = "Subnet A"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_b will be created
  + resource "aws_subnet" "subnet_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Subnet B"
        }
      + tags_all                                       = {
          + "Name" = "Subnet B"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.my_vpc will be created
  + resource "aws_vpc" "my_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "VPC"
        }
      + tags_all                             = {
          + "Name" = "VPC"
        }
    }

Plan: 19 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ofelix60, Action: `pull_request`*